saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/AnalogDevices.CM4xx_DFP.1.4.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>AnalogDevices</vendor>
  <name>CM4xx_DFP</name>
  <url>http://download.analog.com/tools/EZBoards/CM41x/Releases/</url>
  <description>Analog Devices ARM Cortex-M4 and ARM Cortex-M0 CM41x Family Device Support</description>

  <releases>
    <release version="1.4.0">
      Added Enhancements to debugger script file.
	  Updated low level peripheral drivers.
    </release>
    <release version="1.3.0">
      Added low level peripheral drivers.
    </release>
    <release version="1.2.0">
	  Merged the Cortex-M4 and Cortex-M0 packs as one single pack.
      Added low level peripheral drivers.
    </release>
  </releases>
  <license>License/2016-03-29-CM41xKP Click Thru SLA.rtf</license>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Analog Devices</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Analog Devices</keyword>
    <keyword>CM41x</keyword>
  </keywords>

  <devices>
    <!-- generated, do not modify this section -->

    <family Dfamily="CM41x Mixed Signal Control Processors" Dvendor="Analog Devices:1">
      <description>
The ADSP-CM41x Mixed Signal Control Processors utilize the ARM Cortex-M4 and ARM Cortex-M0 processor cores
integrated with high precision ADCs, digital accelerators and filters, SRAM and flash
memories and a rich set of peripherals.
      </description>
	  
      <environment name="uv">
        <CMisc>--C99</CMisc>
      </environment>
	  
	    <feature type="VCC"          n="3.13"   m="3.47"/>
        <feature type="Temp"         n="-40"    m="105"        name="Extended Operating Temperature Range"/>
		
	    <device Dname="ADSP-CM419F">
		  <processor Dcore="Cortex-M4" Pname="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="240000000"/>
          <processor Dcore="Cortex-M0" Pname="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="100000000"/>
          <memory  Pname="Cortex-M4" id="IROM1"  start="0x11000000"  size="0x00080000"  startup="1"   default="1"/>
          <memory  Pname="Cortex-M4" id="IROM2"  start="0x11080000"  size="0x00080000"  startup="0"   default="1"/>
          <memory  Pname="Cortex-M4" id="IRAM1"  start="0x20010000"  size="0x00018000"  init   ="1"   default="1"/>
          <memory  Pname="Cortex-M4" id="IRAM2"  start="0x10000000"  size="0x00010000"  init   ="0"   default="1"/>
		  <memory  Pname="Cortex-M0" id="IRAM1"  start="0x200F0000"  size="0x00008000"  startup="1" init   ="1"   default="1"/>
          <algorithm  Pname="Cortex-M4" name="Flash/CM41x_FlashA_512.FLM"  start="0x11000000"  size="0x00080000"  RAMstart="0x10008000"  RAMsize="0x10000"  default="1"/>
          <algorithm  Pname="Cortex-M4" name="Flash/CM41x_FlashB_512.FLM"  start="0x11080000"  size="0x00080000"  RAMstart="0x10008000"  RAMsize="0x10000"  default="1"/>
		  <compile Pname="Cortex-M4" header="Device/inc/M4/CM41x_M4_device.h"/>
		  <compile Pname="Cortex-M0" header="Device/inc/M0/CM41x_M0_device.h"/>
          <debug Pname="Cortex-M4" svd="SVD/CM41x_M4.svd"/>
		  <debug Pname="Cortex-M0" svd="SVD/CM41x_M0.svd"/>
        </device>
		
    </family>
  </devices>

 <conditions>
    <!-- conditions are dependecy rules that can apply to a component or an individual file -->
	
	<condition id="CM41x M4/M0 Device">
    <description>Analog Devices CM41x devices</description>
    <accept Dvendor="Analog Devices:1"  Dcore="Cortex-M4"/>
    <accept Dvendor="Analog Devices:1"  Dcore="Cortex-M0" />
    </condition>
	
	<condition id="CM41x M4 Device">
    <description>Analog Devices CM41x devices</description>
    <require Dvendor="Analog Devices:1"  Dcore="Cortex-M4" />
    </condition>
	
	<condition id="CM41x M0 Device">
    <description>Analog Devices CM41x devices</description>
    <require Dvendor="Analog Devices:1"  Dcore="Cortex-M0" />
    </condition>
	
	<condition id="Compiler ARM/M4">
      <!-- conditions selecting ARM Compiler -->
      <require Tcompiler="ARMCC"/>
	  <require Dvendor="Analog Devices:1"  Dcore="Cortex-M4" />
    </condition>
	
    <condition id="Compiler ARM/M0">
      <!-- conditions selecting ARM Compiler -->
      <require Tcompiler="ARMCC"/>
	  <require Dvendor="Analog Devices:1"  Dcore="Cortex-M0" />
    </condition>
	
    <condition id="Compiler ARM">
      <!-- conditions selecting ARM Compiler -->
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="CM41x CMSIS Device">
      <!-- conditions selecting Devices -->
      <description>Analog Devices CM41x devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    <accept Dvendor="Analog Devices:1"  Dcore="Cortex-M4" />
    <accept Dvendor="Analog Devices:1"  Dcore="Cortex-M0" />
    </condition>

	<condition id="CM41x CMSIS Device + OSAL">
	  <require condition="CM41x CMSIS Device"/>
	  <require Cclass="Device" Cgroup="OSAL" Csub="PORTS"/>
	  <require Cclass="Device" Cgroup="OSAL" Csub="Source"/>
	</condition>
	
	<condition id="CM41x CMSIS Device + Interrupt">
	  <require condition="CM41x CMSIS Device"/>
	  <require Cclass="Device" Cgroup="Services" Csub="Interrupt"/>
	</condition>
	
	<condition id="CM41x CMSIS Device + Power">
	  <require condition="CM41x CMSIS Device"/>
	  <require Cclass="Device" Cgroup="Services" Csub="Power"/>
	</condition>

  </conditions>
  
  <taxonomy>
    <description Cclass="Device" Cgroup="OSAL" doc="Documents/html/index.html" >Analog Devices OS (no OS) component for CM41x Devices</description>
    <description Cclass="Device" Cgroup="Services" doc="Documents/html/index.html" >Analog Devices Services component for CM41x Devices</description>
    <description Cclass="Device" Cgroup="Drivers" doc="Documents/html/index.html" >Analog Devices driver components for CM41x Devices</description>
  </taxonomy>

