saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/AnalogDevices.CM4xx_DFP.1.4.0.pdsc
  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.0" condition="CM41x CMSIS Device + Power">
      <!-- Cversion is necessary -->
      <description>System Startup for Analog Devices CM41x device series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>

      <files>
        <!-- header path -->
        <file category="include" name="Device/inc/M4/"                  condition="CM41x M4 Device"/>
        <file category="header"  name="Device/inc/M4/CM41x_M4_device.h" condition="CM41x M4 Device"/>
		
        <file category="include" name="Device/inc/M0/"                  condition="CM41x M0 Device"/>
        <file category="header"  name="Device/inc/M0/CM41x_M0_device.h" condition="CM41x M0 Device"/>

        <!-- startup/system files -->
        <file category="source"  name="Device/src/M4/startup_CM41x_M4.s" attr="config"  condition="Compiler ARM/M4" version="1.4.0"/>
        <file category="source"  name="Device/src/M4/system_CM41x_M4.c"  attr="config"  condition="Compiler ARM/M4" version="1.4.0"/>
		
		<file category="source"  name="Device/src/M0/startup_CM41x_M0.s" attr="config"  condition="Compiler ARM/M0" version="1.4.0"/>
        <file category="source"  name="Device/src/M0/system_CM41x_M0.c"  attr="config"  condition="Compiler ARM/M0" version="1.4.0"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="Retarget" Cversion="1.4.0" condition="CM41x CMSIS Device + Interrupt">
      <description>Retargeting for CM41x Devices</description>
      <files>
        <file category="source" name="Device/src/Retarget.c"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="Services" Csub="Interrupt" Cversion="1.4.0" condition="CM41x CMSIS Device + OSAL">
      <description>Interrupt</description>
      <files>
        <file category="source" name="Device/src/services/int/adi_int.c"/>
        <file category="source" name="Device/src/services/int/adi_nvic.c"/>
        <file category="header" name="Device/inc/services/int/adi_int.h"/>
        <file category="header" name="Device/inc/adi_nvic.h"/>
        <file category="doc" name="Documents/html/group___i_n_t_e_r_r_u_p_t_s.html"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="Services" Csub="Power" Cversion="1.4.0" condition="CM41x M4/M0 Device">
      <description>Power</description>
      <files>
        <file category="source" name="Device/src/services/pwr/adi_pwr.c"/>
        <file category="header" name="Device/inc/services/pwr/adi_pwr.h"/>
        <file category="doc" name="Documents/html/group___power___service.html"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="Services" Csub="DMA" Cversion="1.4.0" condition="CM41x M4/M0 Device">
      <description>DMA </description>
      <files>
        <file category="source" name="Device/src/services/dma/adi_dma.c"/>
        <file category="header" name="Device/inc/services/dma/adi_dma.h"/>
        <file category="doc" name="Documents/html/group___d_m_a___manager.html"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="Services" Csub="TRU" Cversion="1.4.0" condition="CM41x M4/M0 Device">
      <description>TRU </description>
      <files>
        <file category="source" name="Device/src/services/tru/adi_tru.c"/>
        <file category="header" name="Device/inc/services/tru/adi_tru.h"/>
        <file category="doc" name="Documents/html/group___t_r_u___manager.html"/>
      </files>
    </component>
    

    <component Cclass="Device" Cgroup="Services" Csub="SMPU" Cversion="1.4.0" condition="CM41x M4/M0 Device">
      <description>SMPU </description>
      <files>
        <file category="source" name="Device/src/services/smpu/adi_smpu.c"/>
        <file category="header" name="Device/inc/services/smpu/adi_smpu.h"/>
        <file category="doc" name="Documents/html/group___s_m_p_u___service.html"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="Services" Csub="Timer" Cversion="1.4.0" condition="CM41x M4/M0 Device">
      <description>Timer</description>
      <files>
        <file category="source" name="Device/src/services/tmr/adi_tmr.c"/>
        <file category="header" name="Device/inc/services/tmr/adi_tmr.h"/>
        <file category="doc" name="Documents/html/group___timer___service.html"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="Services" Csub="GPIO" Cversion="1.4.0" condition="CM41x M4/M0 Device">
      <description>GPIO</description>
      <files>
        <file category="source" name="Device/src/services/gpio/adi_gpio.c"/>
        <file category="header" name="Device/inc/services/gpio/adi_gpio.h"/>
        <file category="doc" name="Documents/html/group___g_p_i_o___service.html"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Services" Csub="MBOX" Cversion="1.4.0" condition="CM41x M4/M0 Device">
      <description>MBOX</description>
      <files>
        <file category="source" name="Device/src/services/mbox/adi_mbox.c"/>
        <file category="header" name="Device/inc/services/mbox/adi_mbox.h"/>
        <file category="doc" name="Documents/html/group___m_b_o_x___manager.html"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Services" Csub="PWM" Cversion="1.4.0" condition="CM41x M4 Device">
      <description>PWM</description>
      <files>
        <file category="source" name="Device/src/services/pwm/adi_pwm.c"/>
        <file category="header" name="Device/inc/services/pwm/adi_pwm.h"/>
        <file category="doc" name="Documents/html/group___p_w_m___service.html"/>
      </files>
    </component>
	
    <component Cclass="Device" Cgroup="Services" Csub="CPT" Cversion="1.4.0" condition="CM41x M4 Device">
      <description>PWM</description>
      <files>
        <file category="source" name="Device/src/services/cpt/adi_cpt_v1.c"/>
        <file category="header" name="Device/inc/services/cpt/adi_cpt_v1.h"/>
        <file category="doc" name="Documents/html/group___c_p_t___driver.html"/>
      </files>
    </component>
	
