saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/AnalogDevices.CM4xx_DFP.1.4.0.pdsc
    <component Cclass="Device" Cgroup="Drivers" Csub="Rotary" Cversion="1.4.0" condition="CM41x M4 Device">
      <description>Rotary</description>
      <files>
        <file category="source" name="Device/src/drivers/rotary/adi_counter.c"/>
        <file category="header" name="Device/inc/drivers/rotary/adi_counter.h"/>
        <file category="doc" name="Documents/html/group__rotary__counter___driver.html"/>
      </files>
    </component>
	
    <component Cclass="Device" Cgroup="Drivers" Csub="HAE" Cversion="1.4.0" condition="CM41x M4/M0 Device">
      <description>HAE</description>
      <files>
        <file category="source" name="Device/src/drivers/hae/adi_hae.c"/>
        <file category="header" name="Device/inc/drivers/hae/adi_hae.h"/>
        <file category="doc" name="Documents/html/group___h_a_e___driver.html"/>
      </files>
    </component>
	
    <component Cclass="Device" Cgroup="Drivers" Csub="SINC" Cversion="1.4.0" condition="CM41x M4 Device">
      <description>SINC</description>
      <files>
        <file category="source" name="Device/src/drivers/sinc/adi_sinc.c"/>
        <file category="header" name="Device/inc/drivers/sinc/adi_sinc.h"/>
        <file category="doc" name="Documents/html/group___s_i_n_c___driver.html"/>
      </files>
    </component>
	
    <component Cclass="Device" Cgroup="Drivers" Csub="DBC" Cversion="1.4.0" condition="CM41x M4 Device">
      <description>SINC</description>
      <files>
        <file category="source" name="Device/src/drivers/dbc/adi_dbc.c"/>
        <file category="header" name="Device/inc/drivers/dbc/adi_dbc.h"/>
        <file category="doc" name="Documents/html/group___d_b_c___driver.html"/>
      </files>
    </component>
	
	<component Cclass="Device" Cgroup="Drivers" Csub="OCU" Cversion="1.4.0" condition="CM41x M4/M0 Device">
      <description>SINC</description>
      <files>
        <file category="source" name="Device/src/drivers/ocu/adi_ocu.c"/>
        <file category="header" name="Device/inc/drivers/ocu/adi_ocu.h"/>
        <file category="doc" name="Documents/html/group___o_c_u___driver.html"/>
      </files>
    </component>
	
	<component Cclass="Device" Cgroup="Drivers" Csub="FOCP" Cversion="1.4.0" condition="CM41x M4 Device">
      <description>SINC</description>
      <files>
        <file category="source" name="Device/src/drivers/focp/adi_focp.c"/>
        <file category="header" name="Device/inc/drivers/focp/adi_focp.h"/>
        <file category="doc" name="Documents/html/group___f_o_c_p___driver.html"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="Drivers" Csub="FFTB" Cversion="1.4.0" condition="CM41x M4/M0 Device">
      <description>FFTB</description>
      <files>
        <file category="source" name="Device/src/drivers/fftb/adi_fftb.c"/>
        <file category="header" name="Device/inc/drivers/fftb/adi_fftb.h"/>
        <file category="doc" name="Documents/html/group___f_f_t_b___driver.html"/>
      </files>
    </component>
	
    <component Cclass="Device" Cgroup="OSAL" Csub="PORTS" Cversion="1.4.0" condition="CM41x M4/M0 Device">
      <description>OSAL-port</description>
      <files>
        <file category="source" name="Device/osal/noos/Ports/ARM-Cortex-M4/KEIL/adi_osal_arch_c.c"         condition="CM41x M4 Device"/>
        <file category="source" name="Device/osal/noos/Ports/ARM-Cortex-M4/KEIL/adi_osal_arch_int_table.c" condition="CM41x M4 Device"/>
        <file category="source" name="Device/osal/noos/Ports/ARM-Cortex-M4/KEIL/adi_osal_noos_arch_c.c"    condition="CM41x M4 Device"/>
        <file category="header" name="Device/osal/noos/Ports/ARM-Cortex-M4/KEIL/adi_osal_arch.h"           condition="CM41x M4 Device"/>
	    <file category="source" name="Device/osal/noos/Ports/ARM-Cortex-M0/KEIL/adi_osal_arch_c.c "        condition="CM41x M0 Device"/>
        <file category="source" name="Device/osal/noos/Ports/ARM-Cortex-M0/KEIL/adi_osal_arch_int_table.c" condition="CM41x M0 Device"/>
        <file category="source" name="Device/osal/noos/Ports/ARM-Cortex-M0/KEIL/adi_osal_noos_arch_c.c"    condition="CM41x M0 Device"/>
        <file category="header" name="Device/osal/noos/Ports/ARM-Cortex-M0/KEIL/adi_osal_arch.h"           condition="CM41x M0 Device"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="OSAL" Csub="Source" Cversion="1.4.0" condition="CM41x M4/M0 Device">
      <description>OSAL-source</description>
      <files>
        <file category="source" name="Device/osal/noos/Source/adi_osal_noos.c"/>
        <file category="source" name="Device/osal/noos/Source/adi_osal_noos_active.c"/>
        <file category="source" name="Device/osal/noos/Source/adi_osal_noos_critical.c"/>
        <file category="source" name="Device/osal/noos/Source/adi_osal_noos_event.c"/>
        <file category="source" name="Device/osal/noos/Source/adi_osal_noos_init.c"/>
        <file category="source" name="Device/osal/noos/Source/adi_osal_noos_mutex.c"/>
        <file category="source" name="Device/osal/noos/Source/adi_osal_noos_prof.c"/>
        <file category="source" name="Device/osal/noos/Source/adi_osal_noos_rtl_lock.c"/>
        <file category="source" name="Device/osal/noos/Source/adi_osal_noos_sem.c"/>
        <file category="source" name="Device/osal/noos/Source/adi_osal_noos_thread.c"/>
        <file category="source" name="Device/osal/noos/Source/adi_osal_noos_timing.c"/>
        <file category="source" name="Device/osal/noos/Source/adi_osal_noos_tls.c"/>
        <file category="header" name="Device/osal/noos/Source/adi_osal.h"/>
        <file category="header" name="Device/osal/noos/Source/osal_common.h"/>
        <file category="header" name="Device/osal/noos/Source/osal_noos.h"/>
        <file category="header" name="Device/osal/noos/Source/version.h"/>
      </files>
    </component>
    
  </components>
  <boards>
    <board vendor="AnalogDevices" name="ADSP-CM419F EZ-BOARD" revision="Ver 1.0">
      <description>Analog Devices CM419F_EZ-KIT Evaluation Board</description>
      <mountedDevice    deviceIndex="0" Dvendor="Analog Devices:1" Dname="ADSP-CM419F"/>
      <compatibleDevice deviceIndex="0" Dvendor="Analog Devices:1" Dname="ADSP-CM419F"/>
      <feature type="PWR"             n="5"              name="External 5.0VDC/3.6A power supply"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
    </board>
  </boards>

  <examples>
    <!-- ADSP-CM419F EZ-BOARD -->
    
    <!-- ADCC -->
    <example name="ADCC_Circular_M4" doc="Readme_ADCC_Circular.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/adcc/ADCC_CIRCULAR" version="1.4.0">
      <description>ADCC (circular)</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/adcc_circular.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="ADCC"/>
      </attributes>
    </example>
    
    <example name="ADCC_Linear_M4" doc="Readme_ADCC_Linear.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/adcc/ADCC_LINEAR" version="1.4.0">
      <description>ADCC (linear)</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/adcc_linear.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="ADCC"/>
      </attributes>
    </example>

    <!-- DACC -->
    <example name="DACC_Circular_M4" doc="Readme_DACC_Circular.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/dacc/DACC_Circular" version="1.4.0">
      <description>DACC (circular)</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/dacc_circular.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="DACC"/>
      </attributes>
    </example>
    
    <example name="DACC_Linear_M4" doc="Readme_DACC_Linear.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/dacc/DACC_Linear" version="1.4.0">
      <description>ADCC (linear)</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/dacc_linear.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="DACC"/>
      </attributes>
    </example>
    
    <!-- CRC -->
    <example name="CrcDmaDataCompare_M4" doc="Readme_CrcDmaDataCompare.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/crc/CrcDmaDataCompare" version="1.4.0">
      <description>CrcDmaDataCompare</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/CrcDmaDataCompare.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="CRC"/>
      </attributes>
    </example>
    
    <example name="CrcDmaDataFill_M4" doc="Readme_CrcDmaDataFill.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/crc/CrcDmaDataFill" version="1.4.0">
      <description>CrcDmaDataFill</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/CrcDmaDataFill.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="CRC"/>
      </attributes>
    </example>
    
    <example name="CrcDmaDataTransfer_M4" doc="Readme_CrcDmaDataTransfer.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/crc/CrcDmaDataTransfer" version="1.4.0">
      <description>CrcDmaDataTransfer</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/CrcDmaDataTransfer.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="CRC"/>
      </attributes>
    </example>
    
    <example name="CrcDmaDataVerify_M4" doc="Readme_CrcDmaDataVerify.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/crc/CrcDmaDataVerify" version="1.4.0">
      <description>CrcDmaDataVerify</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/CrcDmaDataVerify.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="CRC"/>
      </attributes>
    </example>
    
