saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/AnalogDevices.CM4xx_DFP.1.4.0.pdsc
    <!-- GPIO -->
    <example name="Button_LED_callback_M4" doc="Readme_Button_LED_GPIO.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/gpio/Button_LED_callback" version="1.4.0">
      <description>Button_LED_callback</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/Button_LED_callback.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Services" Csub="GPIO"/>
      </attributes>
    </example>
    
    <example name="Button_LED_polled_M4" doc="Readme_Button_LED_GPIO_polled.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/gpio/Button_LED_polled" version="1.4.0">
      <description>Button_LED_polled</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/Button_LED_polled.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Services" Csub="GPIO"/>
      </attributes>
    </example>
    
    <!-- MDMA -->
    <example name="MemCopyArrayMode_M4" doc="Readme_MemCopyArrayMode.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/MDMA/MemCopyArrayMode" version="1.4.0">
      <description>MemCopyArrayMode</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/MemCopyArrayMode.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Services" Csub="DMA"/>
      </attributes>
    </example>
    
    <example name="MemCopyListMode_M4" doc="Readme_MemCopyListMode.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/MDMA/MemCopyListMode" version="1.4.0">
      <description>MemCopyListMode</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/MemCopyListMode.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Services" Csub="DMA"/>
      </attributes>
    </example>
    
    <example name="MemCopyOneShot1D_M4" doc="Readme_MemCopyOneShot1D.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/MDMA/MemCopyOneShot1D" version="1.4.0">
      <description>MemCopyOneShot1D</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/MemCopyOneShot1D.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Services" Csub="DMA"/>
      </attributes>
    </example>
    
    <example name="MemCopyOneShot2D_M4" doc="Readme_MemCopyOneShot2D.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/MDMA/MemCopyOneShot2D" version="1.4.0">
      <description>MemCopyOneShot2D</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/MemCopyOneShot2D.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Services" Csub="DMA"/>
      </attributes>
    </example>
    
    <example name="MemCopyOneToMany_M4" doc="Readme_MemCopyOneToMany.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/MDMA/MemCopyOneToMany" version="1.4.0">
      <description>MemCopyOneToMany</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/MemCopyOneToMany.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Services" Csub="DMA"/>
      </attributes>
    </example>
    
    <!-- SMPU -->
    <example name="CM41x_region_protection_M4" doc="M4/Readme_SMPU_Example.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/smpu/CM41x_region_protection" version="1.4.0">
      <description>CM41x_region_protection</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/region_protection.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Services" Csub="SMPU"/>
      </attributes>
    </example>
    
    <!-- SPI -->
    <example name="spi_flashread_M4" doc="Readme_spi_flashreadback.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/spi/spi_flashread" version="1.4.0">
      <description>spi_flashread</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/spi_flashreadback.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="SPI"/>
      </attributes>
    </example>
    
    <!-- SPORT -->
    <example name="SPORT_loopback_M4" doc="Readme_SPORT_loopback.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/sport/SPORT_loopback" version="1.4.0">
      <description>SPORT_loopback</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/sport_loopback.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="SPORT"/>
      </attributes>
    </example>
    
