saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/AnalogDevices.CM4xx_DFP.1.4.0.pdsc
	<!-- LCD -->
    <example name="lcd_graphics_M4" doc="lcd_graphics/Readme_lcd_graphics.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/lcd/adafruit1480" version="1.4.0">
      <description>lcd_graphics</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="lcd_graphics/M4/lcd_graphics.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="LCD"/>
      </attributes>
    </example>
	
	<example name="lcd_text_M4" doc="lcd_text/Readme_lcd_text.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/lcd/adafruit1480" version="1.4.0">
      <description>lcd_text</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="lcd_text/M4/lcd_text.uvprojx"/>
      </project>
    <attributes>
      <category>Getting Started</category>
      <component Cclass="Device" Cgroup="Drivers" Csub="LCD"/>
    </attributes>
  </example>
  
    <!-- UNIQUE ID -->
    <example name="Get_Unique_ID_M4" doc="Readme_Get_Unique_ID.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/uniqueid/Get_Unique_ID" version="1.4.0">
      <description>Get_Unique_ID</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/Get_Unique_ID.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
      </attributes>
    </example>
    
    <!-- Rotary -->
    <example name="rotary_trigger_up_down_M4" doc="Readme_rotary_trigger_up_down.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/rotary/rotary_trigger_up_down" version="1.4.0">
      <description>rotary_trigger_up_down</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/rotary_trigger_up_down.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="Rotary"/>
      </attributes>
    </example>
	
    <!-- HAE -->
    <example name="HAE_Callback_M4" doc="Readme_HAE_Callback.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/hae/HAE_Callback" version="1.4.0">
      <description>HAE_Callback</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/HAE_Callback.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="HAE"/>
      </attributes>
    </example>
	
    <example name="HAE_Dma_M4" doc="Readme_HAE_Dma.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/hae/HAE_Dma" version="1.4.0">
      <description>HAE_Dma</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/HAE_Dma.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="HAE"/>
      </attributes>
    </example>
	
    <example name="HAE_Parity_M4" doc="Readme_HAE_Parity.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/hae/HAE_Parity" version="1.4.0">
      <description>HAE_Parity</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/HAE_Parity.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="HAE"/>
      </attributes>
    </example>
	
    <!-- SINC -->
    <example name="SINC_Config_M4" doc="Readme_SINC_Config.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/sinc/SINC_Config" version="1.4.0">
      <description>SINC_Config</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/SINC_Config.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="SINC"/>
      </attributes>
    </example>
	
    <!-- DBC -->
    <example name="DBC_Glitch_M4" doc="Readme_DBC_Glitch.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/dbc/DBC_Glitch" version="1.4.0">
      <description>DBC_Glitch</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/DBC_Glitch.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="DBC"/>
      </attributes>
    </example>
	
    <!-- WD -->
    <example name="watchdog_M4" doc="Readme_watchdog.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/wd/watchdog" version="1.4.0">
      <description>watchdog</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/watchdog.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Services" Csub="WD"/>
      </attributes>
    </example>
	
	<!-- CPT -->
    <example name="cpt_count_M4" doc="Readme_cpt_count.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/cpt/cpt_count" version="1.4.0">
      <description>cpt_count</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/cpt_count.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Services" Csub="CPT"/>
      </attributes>
    </example>
	
