saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/AnalogDevices.CM4xx_DFP.1.4.0.pdsc
	<!-- SPU -->
    <example name="spu_example_M4" doc="Readme_spu_example.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/spu/spu_example" version="1.4.0">
      <description>spu_example</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/spu_example.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Services" Csub="SPU"/>
      </attributes>
    </example>
	
	<!-- FOCP -->
    <example name="focp_example_M4" doc="Readme_FOCP_example.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/focp/focp_example" version="1.4.0">
      <description>focp_example</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/focp_example.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="FOCP"/>
      </attributes>
    </example>
	
	<!-- FFTB -->
    <example name="fftb_core_M4" doc="Readme_fftb_core.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/fftb/FFTB_Core" version="1.4.0">
      <description>fftb_core</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/fftb_core.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="FFTB"/>
      </attributes>
    </example>
	
    <example name="fftb_avg_M4" doc="Readme_fftb_avg.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/fftb/FFTB_Avg" version="1.4.0">
      <description>fftb_avg</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/fftb_avg.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="FFTB"/>
      </attributes>
    </example>
	
    <example name="fftb_comb_M4" doc="Readme_fftb_comb.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/fftb/FFTB_Comb" version="1.4.0">
      <description>fftb_comb</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/fftb_comb.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="FFTB"/>
      </attributes>
    </example>
	
    <example name="fftb_comp_M4" doc="Readme_fftb_compare.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/fftb/FFTB_Comp" version="1.4.0">
      <description>fftb_comp</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/fftb_compare.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="FFTB"/>
      </attributes>
    </example>
	
    <example name="fftb_dma_M4" doc="Readme_fftb_dma.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/fftb/FFTB_DMA" version="1.4.0">
      <description>fftb_dma</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/fftb_dma.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="FFTB"/>
      </attributes>
    </example>
	
    <example name="fftb_fmtconv_M4" doc="Readme_fftb_fmtconv.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/fftb/FFTB_FMTConv" version="1.4.0">
      <description>fftb_fmtconv</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/fftb_fmtconv.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="FFTB"/>
      </attributes>
    </example>
	
    <example name="fftb_oneshottrig_M4" doc="Readme_fftb_oneshottrig.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/fftb/FFTB_OneshotTrig" version="1.4.0">
      <description>fftb_oneshottrig</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/fftb_oneshottrig.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="FFTB"/>
      </attributes>
    </example>
	
    <example name="fftb_wind_M4" doc="Readme_fftb_wind.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/fftb/FFTB_Wind" version="1.4.0">
      <description>fftb_wind</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/fftb_wind.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="FFTB"/>
      </attributes>
    </example>
	
	<example name="flash_example_M4" doc="Readme_flash_example.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/flash/flash_example" version="1.4.0">
      <description>flash_example</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/flash_example.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="Flash"/>
      </attributes>
    </example>
    <!-- ADSP-CM419F EZ-BOARD -->
    
    <!-- ADCC -->
    <example name="ADCC_Circular_M0" doc="Readme_ADCC_Circular.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/adcc/ADCC_CIRCULAR" version="1.4.0">
      <description>ADCC (circular)</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M0"/>
      <project>
        <environment name="uv" load="M0/adcc_circular.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="ADCC"/>
      </attributes>
    </example>
    
    <example name="ADCC_Linear_M0" doc="Readme_ADCC_Linear.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/adcc/ADCC_LINEAR" version="1.4.0">
      <description>ADCC (linear)</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M0"/>
      <project>
        <environment name="uv" load="M0/adcc_linear.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="ADCC"/>
      </attributes>
    </example>
	
