saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/AnalogDevices.CM4xx_DFP.1.4.0.pdsc
    <!-- GPIO -->
    <example name="Button_LED_callback_M0" doc="Readme_Button_LED_GPIO.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/gpio/Button_LED_callback" version="1.4.0">
      <description>Button_LED_callback</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M0"/>
      <project>
        <environment name="uv" load="M0/Button_LED_callback.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Services" Csub="GPIO"/>
      </attributes>
    </example>
    
    <example name="Button_LED_polled_M0" doc="Readme_Button_LED_GPIO_polled.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/gpio/Button_LED_polled" version="1.4.0">
      <description>Button_LED_polled</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M0"/>
      <project>
        <environment name="uv" load="M0/Button_LED_polled.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Services" Csub="GPIO"/>
      </attributes>
    </example>
	
    <!-- Systick -->
    <example name="SysTick_M0" doc="readme.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/SysTick" version="1.4.0">
      <description>SysTick test</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M0"/>
      <project>
        <environment name="uv" load="M0/SysTick.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Services" Csub="Interrupt"/>
      </attributes>
    </example>
    
    <!-- Timer -->
    <example name="Timer_Callback_M0" doc="Readme_timer_with_callback.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/timers/Timer_Callback" version="1.4.0">
      <description>timer with callback</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M0"/>
      <project>
        <environment name="uv" load="M0/timer_with_callback.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Services" Csub="Timer"/>
      </attributes>
    </example>
    
    <!-- TRU -->
    <example name="SwTriggerMemDma_M0" doc="Readme_SwTriggerMemDma.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/tru/SwTriggerMemDma" version="1.4.0">
      <description>SwTriggerMemDma</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M0"/>
      <project>
        <environment name="uv" load="M0/tru.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Services" Csub="TRU"/>
      </attributes>
    </example>

  
    <!-- UART -->
    <example name="UART loopback_M0" doc="Readme_uart_loopback.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/uart/loopback" version="1.4.0">
      <description>UART loopback</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M0"/>
      <project>
        <environment name="uv" load="M0/uart_loopback.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="UART"/>
      </attributes>
    </example>

    <!-- MBOX -->
    <example name="Mbox Example_M0" doc="Readme_Mbox_Example.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/mbox/Mbox_Example" version="1.4.0">
      <description>Mbox Example</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M0"/>
      <project>
        <environment name="uv" load="M0/Mbox_Example_M0.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Services" Csub="MBOX"/>
      </attributes>
    </example>
	
	<!-- Mbox_SemaMutex -->
    <example name="Mbox_SemaMutex_M0" doc="Readme_Mbox_SemaMutex.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/mbox/Mbox_SemaMutex" version="1.4.0">
      <description>Mbox_SemaMutex</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M0"/>
      <project>
        <environment name="uv" load="M0/Mbox_SemaMutex_M0.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Services" Csub="MBOX"/>
      </attributes>
    </example>

    <!-- SMPU -->
    <example name="CM41x_region_protection_M0" doc="M0/Readme_SMPU_Example.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/smpu/CM41x_region_protection" version="1.4.0">
      <description>CM41x_region_protection</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M0"/>
      <project>
        <environment name="uv" load="M0/region_protection.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Services" Csub="SMPU"/>
      </attributes>
    </example>
	
    <!-- HAE -->
    <example name="HAE_Callback_M0" doc="Readme_HAE_Callback.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/hae/HAE_Callback" version="1.4.0">
      <description>HAE_Callback</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M0"/>
      <project>
        <environment name="uv" load="M0/HAE_Callback.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="HAE"/>
      </attributes>
    </example>
	
    <example name="HAE_Parity_M0" doc="Readme_HAE_Parity.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/hae/HAE_Parity" version="1.4.0">
      <description>HAE_Parity</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M0"/>
      <project>
        <environment name="uv" load="M0/HAE_Parity.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="HAE"/>
      </attributes>
    </example>

    <!-- WD -->	
    <example name="watchdog_M0" doc="Readme_watchdog.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/wd/watchdog" version="1.4.0">
      <description>HAE_Parity</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M0"/>
      <project>
        <environment name="uv" load="M0/watchdog.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Services" Csub="WD"/>
      </attributes>
    </example>
	
