saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/AnalogDevices.CM4xx_DFP.1.4.0.pdsc
    <!-- TTU -->
    <example name="trigger_chain_M0" doc="M0/Readme_ttu.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/ttu/trigger_chain" version="1.4.0">
      <description>trigger_chain</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M0"/>
      <project>
        <environment name="uv" load="M0/ttu.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="TTU"/>
      </attributes>
    </example>
	
    <!-- SPU -->
    <example name="spu_example_M0" doc="Readme_spu_example.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/spu/spu_example" version="1.4.0">
      <description>spu_example</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M0"/>
      <project>
        <environment name="uv" load="M0/spu_example.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Services" Csub="SPU"/>
      </attributes>
    </example>
	
	<!-- CRC -->
    <example name="CrcDmaDataCompare_M0" doc="Readme_CrcDmaDataCompare.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/crc/CrcDmaDataCompare" version="1.4.0">
      <description>CrcDmaDataCompare</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M0"/>
      <project>
        <environment name="uv" load="M0/CrcDmaDataCompare.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="CRC"/>
      </attributes>
    </example>
    
    <example name="CrcDmaDataFill_M0" doc="Readme_CrcDmaDataFill.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/crc/CrcDmaDataFill" version="1.4.0">
      <description>CrcDmaDataFill</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M0"/>
      <project>
        <environment name="uv" load="M0/CrcDmaDataFill.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="CRC"/>
      </attributes>
    </example>
    
    <example name="CrcDmaDataTransfer_M0" doc="Readme_CrcDmaDataTransfer.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/crc/CrcDmaDataTransfer" version="1.4.0">
      <description>CrcDmaDataTransfer</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M0"/>
      <project>
        <environment name="uv" load="M0/CrcDmaDataTransfer.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="CRC"/>
      </attributes>
    </example>
    
    <example name="CrcDmaDataVerify_M0" doc="Readme_CrcDmaDataVerify.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/crc/CrcDmaDataVerify" version="1.4.0">
      <description>CrcDmaDataVerify</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M0"/>
      <project>
        <environment name="uv" load="M0/CrcDmaDataVerify.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="CRC"/>
      </attributes>
    </example>
	
	<!-- DACC -->
    <example name="DACC_Circular_M0" doc="Readme_DACC_Circular.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/dacc/DACC_Circular" version="1.4.0">
      <description>DACC (circular)</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M0"/>
      <project>
        <environment name="uv" load="M0/dacc_circular.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="DACC"/>
      </attributes>
    </example>
	
	<!-- FFTB -->
    <example name="FFTB_Avg_M0" doc="Readme_fftb_avg.txt" folder="Boards\AnalogDevices\ADSP-CM419x-EZ-BOARD\fftb\FFTB_Avg" version="1.4.0">
      <description>FFTB_Avg</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M0"/>
      <project>
        <environment name="uv" load="M0/fftb_avg.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="FFTB"/>
      </attributes>
    </example>
	
    <example name="FFTB_Comb_M0" doc="Readme_fftb_comb.txt" folder="Boards\AnalogDevices\ADSP-CM419x-EZ-BOARD\fftb\FFTB_Comb" version="1.4.0">
      <description>FFTB_Comb</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M0"/>
      <project>
        <environment name="uv" load="M0/fftb_comb.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="FFTB"/>
      </attributes>
    </example>
	
    <example name="FFTB_Comp_M0" doc="Readme_fftb_compare.txt" folder="Boards\AnalogDevices\ADSP-CM419x-EZ-BOARD\fftb\FFTB_Comp" version="1.4.0">
      <description>FFTB_Comp</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M0"/>
      <project>
        <environment name="uv" load="M0/fftb_compare.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="FFTB"/>
      </attributes>
    </example>
	
    <example name="FFTB_Core_M0" doc="Readme_fftb_core.txt" folder="Boards\AnalogDevices\ADSP-CM419x-EZ-BOARD\fftb\FFTB_Core" version="1.4.0">
      <description>FFTB_Core</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M0"/>
      <project>
        <environment name="uv" load="M0/fftb_core.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="FFTB"/>
      </attributes>
    </example>
	
    <example name="FFTB_DMA_M0" doc="Readme_fftb_dma.txt" folder="Boards\AnalogDevices\ADSP-CM419x-EZ-BOARD\fftb\FFTB_DMA" version="1.4.0">
      <description>FFTB_DMA</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M0"/>
      <project>
        <environment name="uv" load="M0/fftb_dma.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="FFTB"/>
      </attributes>
    </example>
	
    <example name="FFTB_FMTConv_M0" doc="Readme_fftb_fmtconv.txt" folder="Boards\AnalogDevices\ADSP-CM419x-EZ-BOARD\fftb\FFTB_FMTConv" version="1.4.0">
      <description>FFTB_FMTConv</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M0"/>
      <project>
        <environment name="uv" load="M0/fftb_fmtconv.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="FFTB"/>
      </attributes>
    </example>
	
    <example name="FFTB_Wind_M0" doc="Readme_fftb_wind.txt" folder="Boards\AnalogDevices\ADSP-CM419x-EZ-BOARD\fftb\FFTB_Wind" version="1.4.0">
      <description>FFTB_Wind</description>
      <board name="ADSP-CM419F EZ-BOARD" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M0"/>
      <project>
        <environment name="uv" load="M0/fftb_wind.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="FFTB"/>
      </attributes>
    </example>
  </examples>

</package>

